<?php
/*
 * Template Name: Страница контаков
 * Description: Это моя кастомная страница контаков
 * Author: Misha Kushnirenko
 * Version: 1.0
 */
include MEBELKA_REQUIRE_DIRECTORY . '/template-parts/content-variables.php';
?>
<?php get_header(); ?>
<main>
    <div class="container">
        <div class="page-main">
            <?= get_sidebar(); ?>
            <div class="main-content">
            <div class="breadcrumbs">
                <div class="container">
                    <div class="breadcrumbs__links">
                        <?php if ( function_exists('yoast_breadcrumb') ) {
                            yoast_breadcrumb();
                        } ?>
                    </div>
                    <h1><?php the_title(); ?></h1>
                </div>
            </div>

            <section class="contact mb-m">
						<div class="contact__container">
							<div class="contact__item">
								<img src="<?= MEBELKA_THEME_DIRECTORY ?>assets/images/contact-img1.svg" alt="Напишите в чат">
								<div class="contact__item__content">
                                    <span><?= __('Напишите в чат' , 'mebelka') ?></span>
                                    <p><?= __('Быстро получить ответ на свой вопрос вы можете, обратившись в чат онлайн.' , 'mebelka') ?></p>
								</div>
								<div class="contact-links">
                                    <?php if($telegram) : ?>
                                        <a href="<?= $telegram ?>" target="_blank" rel="nofollow">
                                            <svg width="19" height="16" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M0.499172 7.2935C0.542805 7.2713 0.586459 7.25021 0.629001 7.23023C1.36858 6.88169 2.11798 6.55535 2.86629 6.22902C2.90665 6.22902 2.97427 6.18129 3.01245 6.16575C3.07026 6.14022 3.12808 6.1158 3.1859 6.09027L3.5186 5.94486C3.74113 5.84829 3.96256 5.75172 4.18509 5.65515C4.62905 5.46201 5.07302 5.26887 5.51698 5.07462C6.40492 4.68834 7.29396 4.30095 8.1819 3.91467C9.06983 3.52839 9.95885 3.14101 10.8468 2.75473C11.7347 2.36845 12.6237 1.98106 13.5117 1.59478C14.3996 1.2085 15.2886 0.821113 16.1766 0.434834C16.374 0.348255 16.5878 0.219495 16.7994 0.181755C16.9772 0.149565 17.1507 0.087406 17.3296 0.0529962C17.6688 -0.0124936 18.043 -0.0391336 18.368 0.104056C18.4804 0.154006 18.584 0.223935 18.6702 0.311625C19.0825 0.726763 19.0247 1.4083 18.9374 1.99216C18.3299 6.06141 17.7223 10.1318 17.1136 14.201C17.0307 14.7593 16.9172 15.3721 16.4842 15.725C16.1177 16.0236 15.5962 16.0569 15.1435 15.9304C14.6909 15.8027 14.2916 15.5352 13.9 15.2722C12.2758 14.1777 10.6504 13.0832 9.0262 11.9888C8.64004 11.729 8.21026 11.3894 8.21463 10.9176C8.21681 10.6335 8.38369 10.3804 8.55386 10.1551C9.96539 8.2814 12.002 6.9938 13.5171 5.20671C13.7309 4.95474 13.8989 4.49964 13.6055 4.35423C13.431 4.26765 13.2302 4.38531 13.071 4.49742C11.0682 5.91267 9.06656 7.32902 7.0638 8.74427C6.41039 9.20603 5.72535 9.68111 4.93777 9.79432C4.2331 9.89644 3.52406 9.69665 2.8423 9.49241C2.2707 9.32147 1.70018 9.14609 1.13186 8.96516C0.829699 8.8697 0.51772 8.76647 0.284282 8.55002C0.050845 8.33357 -0.0833088 7.96949 0.0574081 7.68089C0.145765 7.49996 0.317028 7.38563 0.497015 7.29239L0.499172 7.2935Z" fill="#003944"/>
                                            </svg>
                                        </a>
                                    <?php endif; ?>
                                    <?php if($instagram) : ?>
                                        <a href="<?= $instagram ?>" target="_blank" rel="nofollow">
                                            <svg width="18" height="20" viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M17.9461 6.30447C17.936 5.54709 17.7942 4.79725 17.5271 4.08847C17.2954 3.49062 16.9416 2.94767 16.4883 2.4943C16.0349 2.04093 15.4919 1.68712 14.8941 1.45547C14.1944 1.19284 13.4553 1.05083 12.7081 1.03547C11.7461 0.992469 11.4411 0.980469 8.99909 0.980469C6.55709 0.980469 6.24409 0.980469 5.28909 1.03547C4.54225 1.05092 3.80344 1.19294 3.10409 1.45547C2.50615 1.68696 1.96311 2.04071 1.50973 2.4941C1.05634 2.94749 0.702583 3.49053 0.471094 4.08847C0.207925 4.7876 0.0662169 5.52658 0.0520937 6.27347C0.00909374 7.23647 -0.00390625 7.54147 -0.00390625 9.98347C-0.00390625 12.4255 -0.00390626 12.7385 0.0520937 13.6935C0.0670937 14.4425 0.208094 15.1805 0.472094 15.8815C0.703978 16.4789 1.05789 17.0215 1.51125 17.4745C1.96461 17.9275 2.50744 18.281 3.10509 18.5125C3.80254 18.7856 4.54147 18.9378 5.29009 18.9625C6.25309 19.0065 6.55809 19.0185 9.00009 19.0185C11.4421 19.0185 11.7551 19.0185 12.7101 18.9625C13.4572 18.9481 14.1964 18.8067 14.8961 18.5445C15.4939 18.3124 16.0368 17.9584 16.4901 17.5049C16.9434 17.0514 17.2973 16.5083 17.5291 15.9105C17.7921 15.2105 17.9331 14.4725 17.9491 13.7235C17.9911 12.7615 18.0041 12.4565 18.0041 10.0135C18.0021 7.57147 18.0021 7.26147 17.9461 6.30447ZM8.99309 14.6025C8.38596 14.6026 7.78474 14.4831 7.22379 14.2508C6.66285 14.0186 6.15316 13.678 5.72385 13.2487C5.29454 12.8194 4.95401 12.3097 4.72173 11.7488C4.48945 11.1878 4.36996 10.5866 4.37009 9.97947C4.37029 9.06541 4.64151 8.17193 5.14946 7.412C5.65741 6.65207 6.37927 6.05981 7.22379 5.71011C8.06831 5.3604 8.99756 5.26896 9.89405 5.44733C10.7905 5.6257 11.614 6.06588 12.2603 6.71222C12.9067 7.35856 13.3469 8.18203 13.5252 9.07852C13.7036 9.975 13.6122 10.9043 13.2625 11.7488C12.9128 12.5933 12.3205 13.3152 11.5606 13.8231C10.8006 14.3311 9.90715 14.6023 8.99309 14.6025ZM13.8001 6.26247C13.6549 6.2688 13.5099 6.24567 13.3739 6.19448C13.2379 6.1433 13.1136 6.06511 13.0086 5.96462C12.9036 5.86414 12.82 5.74344 12.7629 5.6098C12.7057 5.47615 12.6763 5.33233 12.6762 5.18699C12.6761 5.04165 12.7055 4.8978 12.7625 4.7641C12.8195 4.63041 12.903 4.50963 13.0079 4.40905C13.1128 4.30847 13.237 4.23016 13.3729 4.17885C13.5089 4.12754 13.6539 4.10427 13.7991 4.11047C14.0789 4.11873 14.3446 4.23564 14.5397 4.43641C14.7348 4.63718 14.844 4.90604 14.8443 5.186C14.8446 5.46596 14.7358 5.73502 14.5411 5.93615C14.3463 6.13728 14.0809 6.25468 13.8011 6.26347L13.8001 6.26247Z" fill="#003944"/>
                                                <path d="M8.99323 12.9835C9.78968 12.9835 10.5535 12.6672 11.1167 12.104C11.6798 11.5408 11.9962 10.777 11.9962 9.98054C11.9962 9.18409 11.6798 8.42027 11.1167 7.8571C10.5535 7.29393 9.78968 6.97754 8.99323 6.97754C8.19679 6.97754 7.43296 7.29393 6.86979 7.8571C6.30662 8.42027 5.99023 9.18409 5.99023 9.98054C5.99023 10.777 6.30662 11.5408 6.86979 12.104C7.43296 12.6672 8.19679 12.9835 8.99323 12.9835Z" fill="#003944"/>
                                            </svg>
                                        </a>
                                    <?php endif; ?>
                                    <?php if($facebook) : ?>
                                        <a href="<?= $facebook ?>" target="_blank" rel="nofollow">
                                            <svg width="10" height="18" viewBox="0 0 10 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M6.39703 17.9969V9.80091H9.16203L9.57303 6.59191H6.39703V4.54791C6.39703 3.62191 6.65503 2.98791 7.98403 2.98791H9.66803V0.127906C8.84803 0.0389058 8.02503 -0.00309421 7.20103 -9.42147e-05C4.75703 -9.42147e-05 3.07903 1.49191 3.07903 4.23091V6.58591H0.332031V9.79591H3.08503V17.9969H6.39703Z" fill="#003944"/>
                                            </svg>
                                        </a>
                                    <?php endif; ?>
                                    <?php if($vk) : ?>
                                        <a href="<?= $vk ?>" target="_blank" rel="nofollow">
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M12.8777 17.3036C7.46669 17.3036 4.18269 13.5486 4.05469 7.30957H6.79469C6.88069 11.8926 8.96569 13.8376 10.5647 14.2346V7.30957H13.1917V11.2636C14.7337 11.0936 16.3467 9.29357 16.8897 7.30957H19.4737C19.0597 9.75057 17.3037 11.5496 16.0617 12.2926C17.3037 12.8926 19.3017 14.4626 20.0727 17.3026H17.2327C16.6327 15.4046 15.1627 13.9336 13.1927 13.7336V17.3036H12.8777Z" fill="#003944"/>
                                            </svg>
                                        </a>
                                    <?php endif; ?>

								</div>
							</div>
                            <?php if($contact_phone) : ?>
                                <div class="contact__item">
                                    <img src="<?= MEBELKA_THEME_DIRECTORY ?>assets/images/contact-img2.svg" alt="<?= __('Позвоните нам' , 'mebelka') ?>">
                                    <div class="contact__item__content">
                                    <span><?= __('Позвоните нам' , 'mebelka') ?></span>
                                    <p><?= __('Быстро получить ответ на свой вопрос вы можете, обратившись в чат онлайн.' , 'mebelka') ?></p>
                                    </div>
                                    <div class="contact__item__bottom">
                                        <a href="tel:<?= $contact_phone ?>"><?= $contact_phone ?></a>
                                        <span><?= __('Ежедневно с 10:00 до 22:00' , 'mebelka') ?></span>
                                    </div>
                                </div>
                            <?php endif;?>
                            <?php if($contact_email) : ?>
                                <div class="contact__item">
                                    <img src="<?= MEBELKA_THEME_DIRECTORY ?>assets/images/contact-img3.svg" alt="<?= __('Электронная почта' , 'mebelka') ?>">
                                    <div class="contact__item__content">
                                    <span><?= __('Электронная почта' , 'mebelka') ?></span>
                                    <p><?= __('Быстро получить ответ на свой вопрос вы можете, обратившись в чат онлайн.' , 'mebelka') ?></p>
                                    </div>
                                    <div class="contact__item__bottom">
                                        <a href="mailto:<?= $contact_email ?>"><?= $contact_email ?></a>
                                        <span><?= __('Круглосуточно' , 'mebelka') ?></span>
                                    </div>
                                </div>
                            <?php endif; ?>
                            <?php if($main_city) : ?>
                                <div class="contact__item">
                                    <img src="<?= MEBELKA_THEME_DIRECTORY ?>assets/images/contact-img4.svg" alt="Адресс">
                                    <div class="contact__item__content">
                                    <span><?= __('Адресс' , 'mebelka') ?></span>
                                    <p><?= __('Быстро получить ответ на свой вопрос вы можете, обратившись в чат онлайн.' , 'mebelka') ?></p>
                                    </div>
                                    <div class="contact__item__bottom">
                                        <div><?= __('Казахстан' , 'mebelka') ?>, <?= $main_city ?></div>
                                        <span><?= __('Доставка бесплатная' , 'mebelka') ?></span>
                                    </div>
                                </div>                            
                            <?php endif; ?>
                            <?php if($contact_work_time) : ?>
							<div class="contact__item">
								<img src="<?= MEBELKA_THEME_DIRECTORY ?>assets/images/contact-img5.svg" alt="<?= __('Режим работы' , 'mebelka') ?> ">
								<div class="contact__item__content">
								<span><?= __('Режим работы' , 'mebelka') ?></span>
								<p><?= __('Быстро получить ответ на свой вопрос вы можете, обратившись в чат онлайн.' , 'mebelka') ?></p>
								</div>
								<div class="contact__item__bottom hours">
									<?= $contact_work_time ?>
								</div>
							</div>
                            <?php endif; ?>
						</div>
					</section>


                <?= the_content(); ?>

                <div class="public mb-m">
                    <p><?= __('Обновлено' , 'mebelka') ?></p>
                    <span><?php echo get_the_modified_date('d.m.Y'); ?></span>
                </div>


            </div>
        </div>
    </div>
</main>
<?php get_footer(); ?>